In [1]:
import pandas as pd
import numpy as np

In [2]:
dataset = pd.read_csv('drug200.csv')

In [3]:
dataset.head()

   Age Sex      BP Cholesterol  Na_to_K   Drug
0   23   F    HIGH        HIGH   25.355  drugY
1   47   M     LOW        HIGH   13.093  drugC
2   47   M     LOW        HIGH   10.114  drugC
3   28   F  NORMAL        HIGH    7.798  drugX
4   61   F     LOW        HIGH   18.043  drugY

In [4]:
dataset.isnull().sum()

Age            0
Sex            0
BP             0
Cholesterol    0
Na_to_K        0
Drug           0
dtype: int64

In [5]:
dataset["Sex_male"]= np.where(dataset["Sex"]=='F',0,1)

In [6]:
dataset.drop("Sex",inplace=True,axis=1)
dataset.head()

   Age      BP Cholesterol  Na_to_K   Drug  Sex_male
0   23    HIGH        HIGH   25.355  drugY         0
1   47     LOW        HIGH   13.093  drugC         1
2   47     LOW        HIGH   10.114  drugC         1
3   28  NORMAL        HIGH    7.798  drugX         0
4   61     LOW        HIGH   18.043  drugY         0

In [7]:
bp_encode={"HIGH":3,"LOW":1,"NORMAL":2}
dataset.BP.value_counts()

BP
HIGH      77
LOW       64
NORMAL    59
Name: count, dtype: int64

In [8]:
dataset.BP =dataset.BP.map(bp_encode)
dataset.head()

   Age  BP Cholesterol  Na_to_K   Drug  Sex_male
0   23   3        HIGH   25.355  drugY         0
1   47   1        HIGH   13.093  drugC         1
2   47   1        HIGH   10.114  drugC         1
3   28   2        HIGH    7.798  drugX         0
4   61   1        HIGH   18.043  drugY         0

In [9]:
cholesterol_count = dataset.Cholesterol.value_counts().sort_values().index
cholesterol_count

Index(['NORMAL', 'HIGH'], dtype='object', name='Cholesterol')

In [10]:
cholesterol_map ={cholesterol_count[i] : i for i in range(len(cholesterol_count))}

In [11]:
print(cholesterol_map)

{'NORMAL': 0, 'HIGH': 1}

In [12]:
dataset.Cholesterol = dataset.Cholesterol.map(cholesterol_map)

In [13]:
dataset.head()

   Age  BP  Cholesterol  Na_to_K   Drug  Sex_male
0   23   3            1   25.355  drugY         0
1   47   1            1   13.093  drugC         1
2   47   1            1   10.114  drugC         1
3   28   2            1    7.798  drugX         0
4   61   1            1   18.043  drugY         0

In [14]:
drug_types=dataset.Drug.value_counts().sort_index().index
drug_types

Index(['drugA', 'drugB', 'drugC', 'drugX', 'drugY'], dtype='object', name='Drug')

In [15]:
drug_map = {drug_types[i] :i for i in range(len(drug_types)) }
drug_map

{'drugA': 0, 'drugB': 1, 'drugC': 2, 'drugX': 3, 'drugY': 4}

In [16]:
dataset.Drug = dataset.Drug.map(drug_map)
dataset.head()

   Age  BP  Cholesterol  Na_to_K  Drug  Sex_male
0   23   3            1   25.355     4         0
1   47   1            1   13.093     2         1
2   47   1            1   10.114     2         1
3   28   2            1    7.798     3         0
4   61   1            1   18.043     4         0

In [17]:
from sklearn.model_selection import train_test_split

In [18]:
X_train,X_test,y_train,y_test = train_test_split(dataset.drop("Drug",axis=1),dataset.Drug,test_size=0.2,shuffle=True,random_state=23)

In [19]:
X_train

     Age  BP  Cholesterol  Na_to_K  Sex_male
47    68   1            1   10.291         1
10    47   1            1   11.767         0
172   39   2            0   17.225         0
44    50   2            0   12.295         0
128   47   1            0   33.542         1
..   ...  ..          ...      ...       ...
91    41   3            0   15.156         1
31    74   3            1    9.567         1
182   20   1            0   11.686         0
40    73   2            1   19.221         0
83    38   3            0   11.326         0

[160 rows x 5 columns]

In [20]:
y_train

47     2
10     2
172    4
44     3
128    4
      ..
91     4
31     1
182    3
40     4
83     0
Name: Drug, Length: 160, dtype: int64

In [21]:
from RandomForest import RandomForest
rdf = RandomForest(num_trees=10,min_scale=3,max_depth=10,n_features=2)

In [22]:
rdf.fit(X_train,y_train)

In [23]:
y_predict = rdf.predict(X_test)